I've also got this problem:

```
  # azurerm_aadb2c_directory.adverts must be replaced
-/+ resource "azurerm_aadb2c_directory" "adverts" {
      ~ billing_type            = "MAU" -> (known after apply)
      + country_code            = "LT" # forces replacement
      + display_name            = "adverts" # forces replacement
      ~ effective_start_date    = "1/1/0001 12:00:00 AM" -> (known after apply)
      ~ id                      = "/subscriptions/627949ad-9d29-4279-9a16-2aa995e3b859/resourceGroups/setupad_westeurope/providers/Microsoft.AzureActiveDirectory/b2cDirectories/setupadadverts.onmicrosoft.com" -> (known after apply)
      - tags                    = {} -> null
      ~ tenant_id               = "b64e7a2b-867b-4da9-813b-82714bf5f0a5" -> (known after apply)
        # (4 unchanged attributes hidden)

      - timeouts {}
    }
```

Forces to recreate after import..